# PathMidpoint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravel..::..PathMidpoint Property
PathOfTravel Class See Also
---
The midpoint of the path. The Z coordinate will equal the view's level elevation.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public XYZ PathMidpoint { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathMidpoint As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ PathMidpoint {
	XYZ^ get ();
}
```

# See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace